app/controllers/application_controller.rb

    def load_current_user!
      @current_user = User.find_by(id: payload[0]['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]