app/controllers/backgrounds_controller.rb

SELECT "backgrounds".* FROM "backgrounds"
---
  def index
    @backgrounds = Background.all

INSERT INTO "backgrounds" ("small", "regular", "full", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["small", "teste 01"], ["regular", "123123123"], ["full", "123123123123"], ["created_at", "2020-10-02 13:04:23.601477"], ["updated_at", "2020-10-02 13:04:23.601477"]]
---
  def create
    @background = Background.new(background_params)

    if @background.save