app/controllers/financiamentos_controller.rb

  def index
    @financiamentos = Financiamento.all
---
SELECT "financiamentos".* FROM "financiamentos"

    def set_financiamento
      @financiamento = Financiamento.find(params[:id])
---
SELECT "financiamentos".* FROM "financiamentos" WHERE "financiamentos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]