app/controllers/users_controller.rb

  def login
    user = User.find_by(email: user_params[:email].to_s.downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "a21"], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)

    if @user.save && @user.authenticate(user_params[:password])
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "a21"], ["password_digest", "$2a$12$.OE5R6PTy6YhmUW7cof9PuI9rMvAk8uaIwDH1EO5ogoIIzcyiIMOW"], ["created_at", "2020-10-01 01:16:13.271109"], ["updated_at", "2020-10-01 01:16:13.271109"]]