app/controllers/whishes_controller.rb

SELECT "whishes".* FROM "whishes"
---
  def index
    @whishes = Whish.all

INSERT INTO "whishes" ("name", "totalBalance", "goalAmount", "goalDate", "created_at", "updated_at", "backgrounds_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @whish = Whish.new(whish_params)

    if @whish.save

SELECT "whishes".* FROM "whishes" WHERE "whishes"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
    def set_whish
      @whish = Whish.find(params[:id])